package com.example.imageclassification.data.local

import androidx.compose.ui.window.Dialog
import com.example.imageclassification.R

/*val ro2yetElKolya = mutableListOf<DialogItem>(
    DialogItem("رؤية الكلية", "ان تكون الكلية " +
            "بلا بلا بلا بلا بلا بلا بلا بلا بلا بلا" +
            " بلا بلا بلا بلا بلا بلا بلا بلا بلا بلا بلا بلا ", null)
)*/
val nabzaAanElKolya = mutableListOf<DialogItem>(
    DialogItem("نبذة عن الكلية","أسهمت الكلية كمؤسسة تعليمية وبحثية حكومية منذ انطلاقها في العام الدراسي 1988/ 1989 وتخريج دفعتها الأولى عام 1922 وحتى الآن في تلبية حاجة المجتمع من معلم وأخصائي وباحث في التخصصات النوعية العامة وذوي الاحتياجات الخاصة، التي تخرجها الكلية وهي (التربية الموسيقية، التربية الفنية، الاقتصاد المنزلي، تكنولوجيا التعليم، الإعلام التربوي)، (التربية الخاصة في المجالات النوعية).\n" +
            "\n" +
            "وتحاول الكلية جاهدة أن تقدم للمجتمع المصري عديد من المخرجات النوعية التي تساهم بالارتقاء بالمجالات التربية الموسيقية والتربية الفنية والاقتصاد المنزلي وتكنولوجيا التعليم والإعلام التربوي، حيث استطاعت الكلية كأول كلية للتربية النوعية على مستوى الجمهورية أن تقدم للمؤسسات التربوية والمهنية على مدار 33 عاما عدد 11120 خريج في تخصصات: سالفة الذكر... كان لهم دوراً كبيراً في الارتقاء بهذه المجالات النوعية بعد فترة كبيرة من النضوب في المؤسسات المسؤولة عن إعداد التخصصات النوعية، فكلية التربية النوعية جامعة عين شمس تتمتع بسمعة طيبة لاهتمامها بالطالب لأننا نؤمن كإدارة كلية، وأعضاء هيئة تدريس وهيئة معاونة وجهاز إداري أن محور العملية التعليمية هو الطالب، فلا ندخر جهدا في دفع الطلاب نحو التميز، والإبداع لبناء جيل من الخريجين النوعيين يحملوا على عاتقهم مستقبل الوطن محافظين على قيم ومبادئ المجتمع المصري." +
            "\n" +
            "",null)
)
val resaletElKolya = mutableListOf<DialogItem>(
    DialogItem("رسالة الكلية","كلية التربية النوعية جامعة عين شمس مؤسسة تعليمية وبحثية وخدمية تعد كوادر متخصصة في التخصصات النوعية العامة وذوي الاحتياجات الخاصة مؤهلين تربويا وأكاديميا ومهنيا وفقا للمعايير القومية، وتجعلهم قادرين على الابتكار والإبداع والمنافسة في سوق العمل محليا وإقليميا، وخدمة المجتمع وتلبية احتياجاته المتجددة.",null)
)
val ro2yetElKolya = mutableListOf<DialogItem>(
    DialogItem("رؤية الكلية", "أن تصبح كلية التربية النوعية جامعة عين شمس رائدة في الإعداد التربوي والأكاديمي والمهني وذات ميزة تنافسية محليا وقوميا وإقليميا ودوليا وقادرة على إدارة نظم التعليم والبحث والمعرفة وبناء الشخصية المتكاملة وتنمية المهارات لتلبية الاحتياجات المجتمعية المتغيرة.", null)
)
val ahdafElKolya = mutableListOf<DialogItem>(
    DialogItem("أهداف الكلية","-إعداد المعلم النوعي التخصصي، لمراحل التعليم قبل الجامعي بمختلف مستوياته في مجالات التربية الفنية والتربية الموسيقية والاقتصاد المنزلي وتكنولوجيا التعليم والإعلام التربوي والتربية الخاصة فى التخصصات السابقة.\n" +
            "\n" +
            "-إعداد الإخصائي الفني ومشرف الأنشطة المدرسية في مراحل التعليم العام في مجالات تكنولوجيا التعليم والإعلام التربوي بفروعه (الصحافة والإذاعة المدرسية، والمسرح المدرسي) والتربية الموسيقية والتربية الفنية والاقتصاد المنزلي.\n" +
            "\n" +
            "-إعداد الطالب في التخصصات الفنية والنوعية المذكورة ليكون مؤهلا فنياً وتربويا للتعامل مع ذوى الاحتياجات الخاصة .\n" +
            "\n" +
            "-إعداد المتخصصين في المجالات النوعية المتمثلة في التخصصات السابقة والتى تتطلبها البيئة المحلية وتؤكد عليها التنمية البيئية المستدامة.\n" +
            "\n" +
            "-العمل على رفع مستوى العاملين في المجالات النوعية السابقة علمياً ومهنياً من خلال البرامج المتنوعة.\n" +
            "\n" +
            "-إجراء البحوث الميدانية والعلمية في المجالات التخصصية المتنوعة بهدف تطوير الفكر والممارسة في هذه المجالات.\n" +
            "\n" +
            "-إبداء المشورة في مجالات عمل الكلية للهيئات والمؤسسات المختلفة.\n" +
            "\n" +
            "-التعاون مع الهيئات والمؤسسات العلمية والثقافية على المستوى المحلي والعربي والدولي في معالجة القضايا التخصصية المشتركة.\n" +
            "\n" +
            "-المساهمة في تطوير التعليم في المجالات النوعية باستحداث تخصصات تواكب المتطلبات المعاصرة والمستقبلية." +
            "\n" , null)
)
val alAqsamElAmalya = mutableListOf<DialogItem>(
    DialogItem("الأقسام العملية بالكلية","-التربية الموسيقية\n" +
            "\n" +
            "-التربية الفنية\n" +
            "\n" +
            "-الإعلام التربوي\n" +
            "\n" +
            "-تكنولوجيا التعليم\n" +
            "\n" +
            "-العلوم النفسية والتربوية\n" +
            "\n" +
            "-الاقتصاد المنزلي",null)
)
val elShoaab = mutableListOf<DialogItem>(
    DialogItem("الشعب التخصصية","",null)
)
val seeaatElModaragat = mutableListOf<DialogItem>(
    DialogItem("سعة المدرجات","",null)
)